КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СпособыМаппингаПоля/КонтурЛогистика_СпособыМаппингаПоля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СпособыМаппингаПоля</name>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеОбщейНастройки</name>
  </enumValues>
  <enumValues>
    <name>РеквизитДокументаОснования</name>
  </enumValues>
  <enumValues>
    <name>РеквизитЗаполненногоТитула</name>
  </enumValues>
  <enumValues>
    <name>ИзПредыдущегоТитула</name>
  </enumValues>
  <enumValues>
    <name>ВычислитьВыражение</name>
  </enumValues>
  <enumValues>
    <name>ДопСвойство</name>
  </enumValues>
  <enumValues>
    <name>ДопРеквизит</name>
  </enumValues>
  <enumValues>
    <name>НеЗаполнять</name>
  </enumValues>
  <enumValues>
    <name>РеквизитСправочникаДокументаУС</name>
  </enumValues>
  <enumValues>
    <name>Автоматически</name>
    <comment>по алгоритмам документооборота / дефолт / проч.</comment>
  </enumValues>
  <enumValues>
    <name>КонтактнаяИнформация</name>
  </enumValues>
  <enumValues>
    <name>ЗначенияСвойствОбъектов</name>
  </enumValues>
  <enumValues>
    <name>ДокументФизическогоЛица</name>
  </enumValues>
  <enumValues>
    <name>ДоговорыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ИзРодительскойНастройки</name>
    <comment>Позволит быстро менять вычисление реквизитов, не зависящих от связанного документа</comment>
  </enumValues>
  <enumValues>
    <name>РеквизитДополнительногоДокумента</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonForms/КонтурЛогистика_НастойкиКонвертации_Помощник/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособыМаппингаНаУдаление = Новый Массив;
	
	ДобавлениеКСтрокеСпискаСвойств = "";
	
	Если Параметры.Свойство("НетТабЧастиТовары") Тогда
		ДобавлениеКСтрокеСпискаСвойств = ", НетТабЧастиТовары";	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры,
		"ВыражениеВычисления, ВыражениеВычисления2, ВыражениеВычисленияСтрокаНеогр, ИмяНастраиваемогоПоля, СвойствоОбъекта,
		|КлючДопСвойстваРеквизита, НастройкаКонвертации, СпособМаппинга, ИмяТабЧастьТовары, ПутьКоллекцияТабЧастьТовары,
		|ПутьКоллекцияТабЧастьТоварыИмяРеквизитаТЧ" + ДобавлениеКСтрокеСпискаСвойств);
	Элементы.ВыражениеВычисления_ЗначениеОбщейНастройки.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_Настройки");
			
	Если ЗначениеЗаполнено(ВыражениеВычисления) И СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение Тогда
		ВыражениеВычисленияСтрокаНеогр = ВыражениеВычисления;
		ВыражениеВычисления = "";
	КонецЕсли;
	
	Если СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДоговорыКонтрагентов
		И ТипЗнч(ВыражениеВычисления2) = Тип("Булево") Тогда
		
		ВернутьПервый = ВыражениеВычисления2;
	КонецЕсли;
	
	УровнейВложенностиДереваРеквизитов = 1;
	
	Если СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ИзПредыдущегоТитула Тогда
		ИзПредыдущегоТитула_Титул = ВыражениеВычисления2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПутьПроизвольнаяТабЧасть) Тогда
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДопРеквизит);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДопСвойство);
	КонецЕсли;
			
	Параметры.Свойство("ЕстьКонтактнаяИнформацияОбъекта", ЕстьКонтактнаяИнформацияОбъекта);
	Если ЕстьКонтактнаяИнформацияОбъекта Тогда
		ИдентификаторВидаКонтактнойИнформации = ВыражениеВычисления;
		ЗаполнитьСписокВыбораВидамиКонтактнойИнформации();
	Иначе
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.КонтактнаяИнформация);
	КонецЕсли;
		
	Параметры.Свойство("ЕстьЗначенияСвойствОбъектов", ЕстьЗначенияСвойствОбъектов);
	Если Не ЕстьЗначенияСвойствОбъектов Тогда
		Элементы.СпособМаппинга.СписокВыбора.Удалить(
			Элементы.СпособМаппинга.СписокВыбора.НайтиПоЗначению(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ЗначенияСвойствОбъектов));
	КонецЕсли;
		
	Параметры.Свойство("ЕстьДокументыФизическихЛиц", ЕстьДокументыФизическихЛиц);
	Если ЕстьДокументыФизическихЛиц Тогда
		ИдентификаторВидаДокумента = ВыражениеВычисления2;
	Иначе
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДокументФизическогоЛица);
	КонецЕсли;
	
	Параметры.Свойство("ЕстьДоговорыКонтрагентов", ЕстьДоговорыКонтрагентов);
	Если Не ЕстьДоговорыКонтрагентов Тогда
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДоговорыКонтрагентов);
	КонецЕсли;
	
	Если ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииДокументов") Тогда 
		
		Если Параметры.Свойство("ТипДополнительногоСвязанногоДокумента", ТипДополнительногоСвязанногоДокумента) Тогда
			ТипОснования = ТипДополнительногоСвязанногоДокумента;
			
			Если Параметры.ИмяТабЧастьТовары <> "" Тогда
				СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования);
			КонецЕсли;
		Иначе
			ТипОснования = НастройкаКонвертации.ТипДокумента1С;
			СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДополнительногоДокумента);
		КонецЕсли;
		
		Элементы.ТипДокументаОснования.Видимость = Ложь;
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС);
		
		Если НастройкаКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
			Или ЗначениеЗаполнено(Параметры.ПутьПроизвольнаяТабЧасть)Тогда
			
			СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ИзПредыдущегоТитула);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПутьКоллекцияТабЧастьТовары) Тогда
			УточнениеТипДокументаСодержащийТЧТовары = "";
		Иначе
			УточнениеТипДокументаСодержащийТЧТовары = ТипОснования;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НастройкаКонвертации.ТипДокумента1С) Тогда
			
			Элементы.СпособМаппинга.СписокВыбора.Удалить(
				Элементы.СпособМаппинга.СписокВыбора.НайтиПоЗначению(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования));
				
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииРегистровСведений") Тогда
		
		ТипОснования = НастройкаКонвертации.ИмяРесурса;
		
		Элементы.УточнениеТипДокументаСодержащийТЧТовары.Видимость = Ложь;
		Элементы.ИзПредыдущегоТитула_Титул.ТолькоПросмотр = Истина;
		
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДополнительногоДокумента);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитЗаполненногоТитула);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС);
		
	Иначе
		// значит ТипЗнч(НастройкаКонвертации) = СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииСправочников 
		
		ТипОснования = НастройкаКонвертации.ТипСправочникаИлиДокументаУС;
		ТипДокументаОснования = НастройкаКонвертации.ТипДокументаОснования;
		
		Если ЗначениеЗаполнено(ТипОснования) И Не ЗначениеЗаполнено(ТипДокументаОснования) Тогда
			
			Если Метаданные.Документы.Найти(НастройкаКонвертации.ТипСправочникаИлиДокументаУС) <> Неопределено Тогда
				ТипДокументаОснования = НастройкаКонвертации.ТипСправочникаИлиДокументаУС;
				СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС);
			ИначеЕсли Метаданные.Справочники.Найти(НастройкаКонвертации.ТипСправочникаИлиДокументаУС) <> Неопределено Тогда
				СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииСправочников") Тогда
			Элементы.УточнениеТипДокументаСодержащийТЧТовары.Видимость = Ложь;
			СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДополнительногоДокумента);
		КонецЕсли;
		
		// метка НКС-1 (поиск в подсистеме по метке покажет связанные)
		// на момент реализации неочевидна необходимость использования этих способов маппинга в настройке конвернтации справочника
		
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ИзПредыдущегоТитула);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитЗаполненногоТитула);
		
		Если ТипОснования = "Строка" Тогда
			
			Элементы.ГруппаВычислитьВыражениеДеревоРеквизитов.Видимость = Ложь;
			
			СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС);
			СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если Параметры.ИмяНастраиваемогоПоля = "ОтказДобавленияСтроки" Тогда
		
		Элементы.ИмяНастраиваемогоПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ИмяНастраиваемогоПоля = "Отказ добавления строки";
		
		УдаляемыеСпособыМаппинга = Новый Массив;
		
		Для каждого ЭлСпособМаппинга Из Элементы.СпособМаппинга.СписокВыбора Цикл
			
			Если ЭлСпособМаппинга.Значение = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять
				Или ЭлСпособМаппинга.Значение = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитЗаполненногоТитула
				Или ЭлСпособМаппинга.Значение = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение Тогда
				Продолжить;
			КонецЕсли;
			
			УдаляемыеСпособыМаппинга.Добавить(ЭлСпособМаппинга);
			
		КонецЦикла;
		
		Для каждого УдСпособМаппинга Из УдаляемыеСпособыМаппинга Цикл
			Элементы.СпособМаппинга.СписокВыбора.Удалить(УдСпособМаппинга);	
		КонецЦикла;
		
		Элементы.ВычислитьВыражениеПояснеине1.Заголовок = "Для отказа добавления строки присвойте в переменную РезультатВычисления значение Истина" 
														+ " В остальных случаях новая строка будет добавлена";
		Элементы.РеквизитДокументаОснованияПояснение6.Заголовок = "Выберите из дерева реквизитов или напишите вложенность (через точку) обращаясь к реквизитам."
																+ " Если выбранный реквизит имеет тип Булево и равен Истина, то новая строка добавлена не будет." 
																+ " В остальных случаях новая строка будет добавлена";
		Элементы.РеквизитДокументаОснованияПояснение7.Заголовок = "Отказ добавления строки вычисляться не будет. 
																 |Новая строка будет добавлена";
																
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкаИнфоПолей") Тогда
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДополнительногоДокумента);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитЗаполненногоТитула);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ИзПредыдущегоТитула);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДопРеквизит);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДопСвойство);
		СпособыМаппингаНаУдаление.Добавить(Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять);
	КонецЕсли;
	
	Для Каждого ТекущееЗначение Из СпособыМаппингаНаУдаление Цикл
		НайденноеЗначение = Элементы.СпособМаппинга.СписокВыбора.НайтиПоЗначению(ТекущееЗначение);
		Если НайденноеЗначение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Элементы.СпособМаппинга.СписокВыбора.Удалить(НайденноеЗначение);
	КонецЦикла;
	
	ПерейтиКСтранице();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособМаппингаПриИзменении(Элемент)
	
	ПерейтиКСтранице();
		
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСтранице()
	
	Если Не ЗначениеЗаполнено(СпособМаппинга) Тогда
		СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;
	КонецЕсли;
	
	ИмяСпособаМаппинга = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяЗначенияПеречисления_КонтурЛогистика(СпособМаппинга);
	Если ИмяСпособаМаппинга = "РеквизитДополнительногоДокумента" Тогда
		ИмяСпособаМаппинга = "РеквизитДокументаОснования";
	КонецЕсли;
	Элементы.ВариантыЗаполнения.ТекущаяСтраница = Элементы[ИмяСпособаМаппинга];
	
	Если СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования
		И ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииДокументов") Тогда
		
		ТипОснования = НастройкаКонвертации.ТипДокумента1С;
		
		Если Не ЗначениеЗаполнено(ПутьКоллекцияТабЧастьТовары) И Не ЗначениеЗаполнено(УточнениеТипДокументаСодержащийТЧТовары) Тогда
			УточнениеТипДокументаСодержащийТЧТовары = ТипОснования;
		КонецЕсли;
	ИначеЕсли СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДополнительногоДокумента Тогда
		ТипОснования = ТипДополнительногоСвязанногоДокумента;
		
	КонецЕсли;
	
	Если (СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования  	
		ИЛИ СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитЗаполненногоТитула  	
		ИЛИ СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС  	
		ИЛИ СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ИзПредыдущегоТитула 	
		ИЛИ СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение 
		ИЛИ СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДокументФизическогоЛица 
		ИЛИ СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ДоговорыКонтрагентов)
		И ТипОснования <> "Строка" Тогда 	
		
		Если СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования Тогда
			
			// Подсунуть список выбора документов 1С
			Для Каждого ДокМета Из Метаданные.Документы Цикл
				
				Элементы.УточнениеТипДокументаСодержащийТЧТовары.СписокВыбора.Добавить(ДокМета.Имя, ДокМета.Синоним, , БиблиотекаКартинок.Документ);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение")
			И Не ЗначениеЗаполнено(ВыражениеВычисленияСтрокаНеогр) Тогда
			
			Если ИмяНастраиваемогоПоля = "ОпасныеГрузыМассивСтруктур" Тогда
				ВыражениеВычисленияСтрокаНеогр =
					"//Пример:
					|//РезультатВычисления = Новый Массив;
					|//// КлассификационныйКод и ГруппаУпаковки не обязательны
					|//ОпГруз = Справочники.КонтурЛогистика_ОписанияОпасныхГрузов.ПолучитьОписаниеОпасногоГруза(
					|//	Объект.НомерООН, Объект.КлассификационныйКод, Объект.ГруппаУпаковки);
					|//РезультатВычисления.Добавить(ОпГруз);";
			ИначеЕсли ИмяНастраиваемогоПоля = "СтраныПроисхожденияПродукцииМассивСтруктур" Тогда
				ВыражениеВычисленияСтрокаНеогр =
					"//Пример:
					|//РезультатВычисления = Новый Массив;
					|//Страна = Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду(""643"");
					|//РезультатВычисления.Добавить(Новый Структура(""Страна"", Страна));";
			Иначе
				ВыражениеВычисленияСтрокаНеогр =
					"//Примеры:
					|//РезультатВычисления = Основание.МойРеквизит;
					|//РезультатВычисления = Объект.МойРеквизит;
					|//РезультатВычисления = МояФункция(Объект);";
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			ПостроитьДеревоРеквизитов();
		Исключение
			Сообщить("Неудача при построении дерева реквизитов по причине: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	Если ЗначениеЗаполнено(ВыражениеВычисленияСтрокаНеогр) И СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение") Тогда 
		ВыражениеВычисления = "";
	Иначе
		ВыражениеВычисленияСтрокаНеогр = "";
	КонецЕсли;
	
	Если СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ДоговорыКонтрагентов") Тогда 
		ВыражениеВычисления2 = ВернутьПервый;	
	КонецЕсли;
	
	ПоляРезультата = "ВыражениеВычисления, ВыражениеВычисления2, ВыражениеВычисленияСтрокаНеогр, ИмяНастраиваемогоПоля, КлючДопСвойстваРеквизита, НастройкаКонвертации, 
	|СпособМаппинга, ИмяТабЧастьТовары, ПутьКоллекцияТабЧастьТовары, ПутьКоллекцияТабЧастьТоварыИмяРеквизитаТЧ, СвойствоОбъекта";
	СтруктураВыполнения = Новый Структура(ПоляРезультата);
	ЗаполнитьЗначенияСвойств(СтруктураВыполнения, ЭтаФорма, ПоляРезультата);
	
	ОповеститьОВыборе(СтруктураВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДеревоРеквизитов()
	
	Дерево = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СформироватьДеревоРеквизитов(
		СпособМаппинга, НастройкаКонвертации, НетТабЧастиТовары, ИмяТабЧастьТовары, ТипОснования,
		УточнениеТипДокументаСодержащийТЧТовары, ТипДокументаОснования, ИзПредыдущегоТитула_Титул, УровнейВложенностиДереваРеквизитов);
	
	// Если не ясен ТипДокументаСодержащийТЧТовары
	Если ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииДокументов") Тогда 
		Если НетТабЧастиТовары = Ложь И ЗначениеЗаполнено(ИмяТабЧастьТовары) Тогда
			Если НЕ ЗначениеЗаполнено(УточнениеТипДокументаСодержащийТЧТовары) Тогда 
				Элементы.УточнениеТипДокументаСодержащийТЧТовары.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоРеквизитовДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовДокументаОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение") Тогда 
		ВыбранныйВДеревеТекст = "Основание." + Элемент.ТекущиеДанные.ПолныйПуть;
	Иначе
		ВыбранныйВДеревеТекст = Элемент.ТекущиеДанные.ПолныйПуть;
	КонецЕсли;
	
	Если СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение") Тогда
		Если ЗначениеЗаполнено(ВыражениеВычисленияСтрокаНеогр) Тогда
			
			Элементы.ВыражениеВычисленияСтрокаНеогр_ВычислитьВыражение.ВыделенныйТекст = ВыбранныйВДеревеТекст;
			
		Иначе
			
			ВыражениеВычисленияСтрокаНеогр = "" + ВыбранныйВДеревеТекст;
			
		КонецЕсли;
		
		ЭтаФорма.ТекущийЭлемент = Элементы.ВыражениеВычисленияСтрокаНеогр_ВычислитьВыражение;
		
	Иначе
		
		ВыражениеВычисления = ВыбранныйВДеревеТекст;
		
	КонецЕсли;

	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзПредыдущегоТитула_ТитулПриИзменении(Элемент)
	
	ВыражениеВычисления2 = ИзПредыдущегоТитула_Титул;
	ПостроитьДеревоРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура УточнениеТипДокументаСодержащийТЧТоварыПриИзменении(Элемент)
	ПостроитьДеревоРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура УровнейВложенностиДереваРеквизитовПриИзменении(Элемент)
	ПостроитьДеревоРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеВычисленияСтрокаНеогр_ВычислитьВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстРедактирования = СтрЗаменить(Элементы.ВыражениеВычисленияСтрокаНеогр_ВычислитьВыражение.ТекстРедактирования, "¶", Символы.ПС);
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьФормуРедактированияТекста(
		ТекстРедактирования, ЭтаФорма, "ВыражениеВычисленияСтрокаНеогр",,, "Объект, Основание");
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторВидаКонтактнойИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы("Справочник.ВидыКонтактнойИнформации.ФормаВыбора",, ЭтаФорма,
		ЭтаФорма, "ИдентификаторВидаКонтактнойИнформацииНачалоВыбораЗаверешени", ЭтаФорма, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторВидаКонтактнойИнформацииНачалоВыбораЗаверешени(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ИдентификаторВидаКонтактнойИнформации = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Результат, "ИдентификаторДляФормул");
	Исключение
		// Значит в текущей версии конфигурации нет реквизита "ИдентификаторДляФормул"
		ИдентификаторВидаКонтактнойИнформации = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Результат, "Наименование");
	КонецПопытки;
	
	ВыражениеВычисления = ИдентификаторВидаКонтактнойИнформации;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторВидаДокументаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы("Справочник.ВидыДокументовФизическихЛиц.ФормаВыбора",, ЭтаФорма,
		ЭтаФорма, "ИдентификаторВидаДокументаНачалоВыбораЗаверешение", ЭтаФорма, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторВидаДокументаНачалоВыбораЗаверешение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ИдентификаторВидаДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Результат, "ИдентификаторДляФормул");
	Исключение
		// Значит в текущей версии конфигурации нет реквизита "ИдентификаторДляФормул"
		ИдентификаторВидаДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Результат, "Наименование");
	КонецПопытки;
	
	ВыражениеВычисления2 = ИдентификаторВидаДокумента;
	
КонецПроцедуры                

&НаСервере
Процедура ЗаполнитьСписокВыбораВидамиКонтактнойИнформации()
	
	ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
	Если (ИмяКонфигурации1С <> "УТ"
		И ИмяКонфигурации1С <> "УПП")
		Или Метаданные.РегистрыСведений.Найти("КонтактнаяИнформация") = Неопределено Тогда
		
		Элементы.ГруппаСтараяВерсияКонтактнойИнформации.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаНоваяВерсияКонтактнойИнформации.Видимость = Ложь;
	
	// Адреса
	Элементы.ИдентификаторВидаКонтактнойИнформацииСтарая.СписокВыбора.Добавить("АдресЮридический", "Юредический адрес");
	Элементы.ИдентификаторВидаКонтактнойИнформацииСтарая.СписокВыбора.Добавить("АдресФактический", "Фактический адрес");
	Если ИмяКонфигурации1С = "УПП" Тогда
		Элементы.ИдентификаторВидаКонтактнойИнформацииСтарая.СписокВыбора.Добавить("АдресПочтовый", "Почтовый адрес");
	КонецЕсли;
	Элементы.ИдентификаторВидаКонтактнойИнформацииСтарая.СписокВыбора.Добавить("АдресРегистрации", "Адрес регистрации");
	
	// Телефоны
	Элементы.ИдентификаторВидаКонтактнойИнформацииСтарая.СписокВыбора.Добавить("ТелефонОрганизации", "Телефон организации");
	Элементы.ИдентификаторВидаКонтактнойИнформацииСтарая.СписокВыбора.Добавить("ТелефонКонтрагента", "Телефон контрагента");
	Элементы.ИдентификаторВидаКонтактнойИнформацииСтарая.СписокВыбора.Добавить("ТелефонФизЛица", "Телефон физ.лица домашний");
	Элементы.ИдентификаторВидаКонтактнойИнформацииСтарая.СписокВыбора.Добавить("ТелефонСлужебный", "Телефон физ.лица служебный");
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторВидаКонтактнойИнформацииСтараяПриИзменении(Элемент)
	
	ВыражениеВычисления = ИдентификаторВидаКонтактнойИнформации;
	
КонецПроцедуры
